/*Пришло время для задач, где вы сможете применить полученные знания на практике.
Обязательные условия выполнения: данные со стандартного ввода читаются функцией readTask(), которая возвращает 3 значения типа пустой интерфейс. Эта функция использует пакеты encoding/json, fmt, и os - не удаляйте их из импорта. Скорее всего, вам понадобится пакет "fmt", но вы можете использовать любой другой пакет для записи в стандартный вывод не удаляя fmt.
И так, вы получаете 3 значения типа пустой интерфейс: если все удачно, то первые 2 значения будут float64. Третье значение в идеальном случае будет строкой, которая может иметь значения: "+", "-", "*", "/" (определенная математическая операция). Но такие идеальные случаи будут не всегда, вы можете получить значения других типов, а также строка в третьем значении может не относится к одной из указанных математических операций.
Результат выполнения программы должен быть таков:
в штатной ситуации вы должны напечатать в стандартный вывод результат выполнения математической операции с точностью до 4 цифры после запятой (fmt.Printf(%.4f));
если первое или второе значение не является типом float64, вы должны напечатать сообщение об ошибке вида: value=полученное_значение: тип_значения (например: value=true: bool)
если третье значение имеет неверный тип или передан знак, не относящийся к указанным выше математическим операциям, сообщение об ошибке должно иметь вид: неизвестная операция
Гарантируется, что ошибка в аргументах может быть только одна, поэтому если вы при проверке первого значения увидели, что оно содержит ошибку - печатайте сообщение об ошибке и завершайте работу программы, проверка остальных аргументов значения уже не имеет, а проверяющая система воспримет 2 сообщения об ошибке как нарушение условия выполнения задания.*/
package main

import "fmt"

func main() {
	var value1 interface{} = 95.000  //float64
	var value2 interface{} = 80.000 //float64
	var operation interface{} = "/" //string + - * /

	var v1, v2 float64
	if value, ok := value1.(float64); ok {
		v1 = value
	} else {
		fmt.Print("value=", value1, ": ")
		fmt.Printf("%T", value1)
		return
	}

	if value, ok := value2.(float64); ok {
		v2 = value
	} else {
		fmt.Print("value=", value2, ": ")
		fmt.Printf("%T", value2)
		return
	}

	switch op := operation.(type) {
	case string:
		if op == "+" || op == "-" || op == "*" || op == "/" {
			fmt.Printf("%.4f", res(v1, v2, op))
		} else {
			fmt.Println("неизвестная операция")
			return
		}
	default:
		fmt.Println("неизвестная операция")
		return
	}

}

func res(a, b float64, op string) float64 {
	switch op {
	case "+":
		return a + b
	case "-":
		return a - b
	case "*":
		return a * b
	case "/":
		return a / b
	default:
		return 0.0
	}
}
