/*Дана строка, содержащая только десятичные цифры. Найти и вывести наибольшую цифру.
Входные данные
Вводится строка ненулевой длины. Известно также, что длина строки не превышает 1000 знаков и строка содержит только десятичные цифры.
Выходные данные
Выведите максимальную цифру, которая встречается во введенной строке.*/
package main

import "fmt"

func main() {
	var str string
	fmt.Scan(&str)

	rs := []rune(str)
	var max = 0
	for i := range rs {
		if int(rs[i]) > max {
			max = int(rs[i])
		}
	}
	fmt.Println(string(max))
}
